---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.DisallowedPathCurve
source: html/ce134743-bce1-1700-4fde-382832fae7aa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.DisallowedPathCurve Property

Cannot create stacked elliptical wall with offsets.

## Syntax (C#)
```csharp
public static FailureDefinitionId DisallowedPathCurve { get; }
```